# coding: utf-8
A1 = 'У Вас твердый и устойчивый характер. Вы обладаете очень хорошей способностью концентрировать внимание на ' \
     'веполнении текущих дел. Вы принимаете хорошо обдуманные решения и здраво судите об этих вопросах. У Вас есть ' \
     'собственное мнение, и Вы не подвержены влиянию своих эмоций или эмоций окружающих людей. Вы можете быть очень ' \
     'преданным и стойким.'
A2 = 'У Вас достаточно стабильный характер. Вы можете, хотя и с небольшими трудностями, концентрироваться на текущих' \
     'делах. Вы стараетесь принимать обдуманные ренения, но у Вас это не всегда получается, так как иногда Вы' \
     'подвержены влиянию своих эмоций или эмоций окружающих людей. Ваше мнение может меняться, так же как и Ваша ' \
     'приверженность.'
A3 = 'У Вас нестабильный характер. Вам очень трудно сосредоточиться на текущих делах, так как Ваше внимание ' \
     'отвлекается на другие вещи или зафиксировано на чем-то, не относящемся к делу. Ваши решения ненадежны, а ' \
     'суждения - неточны. Вы легко попадаете под влияние других людей, поэтому Ваши мнения меняются то в одну, то в' \
     'другую сторону.'
A4 = 'У Вас крайне нестабильный характер. У Вас плохая панять и Вам трудно сосредоточиться на текущих делах, или же' \
     'Ваше внимание постоянно и навязчиво зафиксировано на чем-то. Вы легко подвержены внушению, поэтому Ваши ' \
     'решения, суждения и мнения ненадежны. Людям трудно Вас понять, так как Вы импульсивны и ненадежны.'
B_circle = 'Кольцо вокруг точки B на Вашем графике показывает, что утверждения о Вашем счастье, которые есть на ' \
           'других карточках, не всегда верны. Ваш уровень счастья нестабилен, и у Вас бывают периоды счастья и ' \
           'радости, которые сменяются периодами депрессии и уныния.'
B1 = 'Обычно Вы вполне счастливы и веселы. Ваш подход у жизни основан на хорошем юморе. В решении проблем Вам присущ' \
     'энтузиазм и интерес. Вы с надеждой смотрите в будущее и спокойно воспринимаете огорчения. Любые проблемы или ' \
     'эмоциональные трудности, с которыми Вы сталкиваетесь, лишь временно расстраивают Вас, но как только они ' \
     'разрешаются, Вы легко возвращаетесь к своему обычному хорошему настроению.'
B2 = 'Вы довольно счастливый и веселый человек, но не всегда. Жизненные проблемы и трудности выводят Вас из ' \
     'равновения, и Вам довольно трудно вновь обрести воодушевление и радостное отношение у жизни. Вы считаете, что' \
     'до некоторой степени Ваше хорошее настроение зависит от других людей и обстоятельств, а не просто от Вашего ' \
     'отношения к жизни. Однако гораздо чаще Вам присуще легкое настроение.'
B3 = 'Вы несчастны и подавлены. У Вас пессимистичное отношение к жизни. Проблемы и трудности кажутся для Вас слишком' \
     'большими и Вам тяжело с ними справляться, так как Вы в основном подавлены. Вы обвиняете других людей, проблемы ' \
     'или обстоятельства в своем подавленном состоянии, вместо того чтобы найти истинную причину в себе. Из-за этого' \
     'Вашим друзьям и членам семьи бывает трудно находиться в Вашем обществе.'
B4 = 'Вы крайне печальны, несчастны и находитесь в состоянии депрессии. Вы смотрите в будущее с полным пессимизмом и ' \
     'безо всякой надежды. Вашим друзьям и членам семьи тружно находиться рядом с Вами, так как Вы возлагаете вину ' \
     'за свою меланхолию на других людей, на обстоятельства или жизненные ситуцации. Вы не видите настоящих причин, ' \
     'ради которых стоило бы дить, так как Ваша жизнь полна проблем и трудностей, которые Вы не можете исправить в ' \
     'своем подавленном состоянии.'
C1 = 'Вам присущи самообладание и невозмутимость. В мыслях Вы уравновешены и в целом спокойны. Ваше самообладание' \
     'позволяет Вам без особых беспокойств для себя и для других справляться с любыми чрезвычайными ситуациями в ' \
     'Вашем окружении. У Вас ровный характер, что помогает Вам иметь хорошие отноения с членами семьи и с друзьями. ' \
     'Вам свойственны терпимость и терпеливость.'
C2 = 'Обычно Вы спокойны и уравновешенны, однако неожиданноые события в Вашем окружении могут нарушить Ваше ' \
     'спокойствие. Как правило, Вас нелегко вывести из себя. Иногда у Вас бывают моемнты нервозности, но Вы способны ' \
     'вновь обрести самообладание. иногда Вы бываете непримиримы и нетерпеливы, что создает трудности для Вашей ' \
     'семьи и Ваших друзей.'
C3 = 'Вы нервозны и чрезмерно возбудимы. Ваша беспокойность и возбужденность раздражает окружающих людей. Вам ' \
     'трудно расслабиться, чтобы отдохнуть и порадоваться жизни. У Вас есть нервные привычки, о которых Вы можете ' \
     'знать или не знать, и эти привычки создают впечатление возбуждения. Ваше внимание легко отвлекается, и у Вас ' \
     'мало самоконтроля.'
C4 = 'Вы постоянно находитесь в нервозном состоянии. Вы не знаете, как контролировать себя даже при обычных' \
     'обстоятельствах. Вы не умеете расслабляться и быть полностью спокойным даже в течение короткого времени. ' \
     'Ваши нервные привычки и состояние возбуждения сильно расстраивают окружающих Вас людей. Вы очень раздражительны' \
     'и можете даже быть истеризным или яростным в своих действиях. Практически все, что угодно, может вывести Вас ' \
     'из себя.'
D1 = 'У Вас большая уверенность в том, что Вы знаете и понимаете в жизни. Вам свойственно хорошее понимание самого ' \
     'себя, своих ценных качеств и недостатков, способностей и слабых сторон, целей и стремлений в жизни. Ваше ' \
     'реалистичное отношение к себе удерживает ВАас от совершения серьезных ошибок.'
D2 = 'Вы можете достаточно реалистично оценить себя, но испытываете небольшие трудности в этом. Ваше понимание ' \
     'самого себя могло бы быть намного лучше. Поскольку Вы не слишком уверены в своих способностях или ' \
     'неспособностях, Вы склонны менять свое отношение к вещам, к тому, что для Вас является правдой. Иногда Вам' \
     'трудно понять, чего Вы хотите достичь в жизни, ожнако не в такой степени, чтобы совершать действительно' \
     'серьезные ошибки.'
D3 = 'Вы ненадежный человек. Вы слабо уверены в себе, и это мешает Вам добиться целей, которые Вы ставите в жизни.' \
     'Из-за того, что Вы так неуверены в себе, Вам также трудно определить, каких целей Вам следует добиваться, а ' \
     'каких нет. Это усугубляется тем, что Вы в действительности не представляете себе, каковы же Ваши способности' \
     'и неспособности.'
D4 = 'Вы совершенно ненадежный человек, и у Вас полностью отсутствует уверенность в себе. Вы совершенно не уверены в ' \
     'Вашем прошлом, Вашем настоящем и Вашем будущем. Вы не знаете, чему верить, что думать, что Вам следует делать ' \
     'в жизни, и это усугубляется тем фактом, что Вы не знаете, что хотите или ждете от жизни. У Вас нет никакой' \
     'уверенности в себе.'
E_circle = 'Кольцо вокруг точки E на Вашем графике показывает, что утверждения о Вашей активности на карточках оценки' \
           'не всегда верны. Этот фактор нестабилен, и в какой-то период Вы активны, а в какой-то нет. Это говорит о ' \
           'том, что Вы чувствуете, будто многие действия навязываются Вам - Вы скорее должны их делать, чем хотите' \
           'их делать.'
E1 = 'Вы очень активный человек, способный определить, что Вы хотите сделать, затем сделать это и завершить это дело.' \
     'Вы справляетесь с проблемами, организуя свою работу, получая хорошие рещультаты без замешательства или почти ' \
     'без замешательства. Вы не откладываете выполнение вадных и необходимых дел, и у Вас есть энергия и ' \
     'настойчивость, чтобы добиться их выполнения.'
E2 = 'В целом Вы активны, но не способны выполнить все, что могли или хотели бы сделать. вам бывает трудно начать ' \
     'выполнение какой-либо работы, а когда дело начато, Вам бывает трудно его завершить. Вы либо решаете выполнить ' \
     'больше, чем можете, либо для Вас представляет трудность решить, что именно надо делать.'
E3 = 'Вы неактивны. Ваша трудность в том, чтобы начать делать те дела, которые, как Вы знаете, нужно сделать или ' \
     'которые Вам хотелось бы сделать. После того как Вы, наконец, начинаете делать что-то, у Вас также возникают ' \
     'большие тружности с продолжением и завершением этой работы или деятельности. Из-за этого у Вас есть трудности' \
     'в Вашей работе или профессии, поэтому Вам трудно сохранить свое рабочее место.'
E4 = 'Вы крайне неактивны. Вам очень редко удается заставить себя начать выполнение даже самых необходимых дел или' \
     'видов работы, и Вы почти никогда не доводите их до конца. Члены Вашей семьи и начальник на работе считают, что ' \
     'Вы ленивы и Вас тружно исправить. Это создает плохие отношения и трудности на работе.'
F1 = 'Вы очень способный и открытый человек. Вы способны хорошо справляться с тем, что решаете делать в жизни. Вы ' \
     'довольно прямолинейны в своем подходе к людям не только на работе или в своей профессии, но также с друзьями ' \
     'и членами семьи, и благодаря этому прямолинейному подходу Вы можете справляться с любыми жизненными ситуациями ' \
     'и контролировать других людей.'
F2 = 'Вы способный и открытый человек, но, возможно, не в такой степени, как Вам того бы хотелось. Несмотря на то, ' \
     'что Вы - способный человек, у Вас бывают отдельные трудности, связанные с жизнью, работой или профессией. ' \
     'Отчасти Ваши трудности вызваны тем, что Вы не очень хорошо умеете открыто работать с людьми и отдавать им ' \
     'необходимые приказы и указания.'
F3 = 'В отношениях людьми Вы замкнуты и покорны, и из-за этого Вы не можете справляться с жизнью. Вы слишком послушны' \
     'и уклончивы в отношениях с другими людьми, так как боитесь того, что они подумают, скажут или сделают. Этот' \
     'страх перед другими людьми мешает Вам честно и открыто справляться с Вашей работой или профессией, мешает в ' \
     'семейных отношениях и в отношениях с друзьями.'
F4 = 'Вы находитесь в очень плохом состоянии по отношению к жизни из-за своей замкнутости и покорности. Вы ' \
     'определенно интровертированы и боитесь прямо работать с людьми или вещами в своем окружении. Вы настолько ' \
     'боитесь других людей, что можете управлять ими только скрытно. Эта неспособность создает вокруг вас атмосферу' \
     'хаоса и проблем.'
G1 = 'Вы довольно ответственный человек. Вы чувствуете, что определенно контролируете свою жизнь. Вы спрособны ' \
     'предпринимать действия и нести ответственность за их успех или неудачу. Вы умеете прямо смотреть на проблемы' \
     'и решать их, используя для этого все свои способности, вместо того, чтобы полагать, что Вас это не касается' \
     'и что другие люди обязаны всем этим заниматься.'
G2 = 'Ваше чувство ответственности не так велико, каким бы ему следовало быть. Это вызвано тем фактором, что у Вас' \
     'есть склонность считать, что кто-то другой в большей или меньшей степени руководит Вашей жизнью, будь то Ваш' \
     'начальник, друг или член семьи. Вы могли бы намного больше контролировать свою жизнь, но предпочитаете не брать' \
     'на себя слишком много ответственности, поскольку полагаете, что если не очень хорошо справитесь, то Вас в этом' \
     'будут обвинять.'
G3 = 'Вы безответственны в жизни и в работе. Вы перекладываете свою ответственность на других дюдей, будь то на ' \
     'Вашего начальника, друга или члена семьи. Вам кажется, что Вы не контролируете свою жизнь, то, что Вы делаете, ' \
     'кем являетесь и то хотите иметь в жизни. Хотя Вы чувствуете, что другие люди контролируют Вас, Вы на самом ' \
     'деле не способны взять контроль на себя.'
G4 = 'Вы совершенно безответственны. Вы обвиняете других в том, что они управляют Вашей жизнью и сделали ее такой, ' \
     'какая она есть, но на самом деле это Ваша собственная вина, поскольку Вы никогда по-настоящему не принимали ' \
     'на себя свою долю ответственности. Вам часто бывает жаль себя, и Вам кажется, что жизньб сделала из Вас жертву.'
H1 = 'Вы вполне понимающий человек. Вы способны наслаждаться своим окружением и окружающими Вас людьми. Ваш ' \
     'общий взгляд на жизнь характеризует справедливость, так как Вы способны увидеть как плохое так и хорошее в ' \
     'людях и в жизни в целов. Вы довольно правильно оцениваете ситуации, и благодаря этому Вы обладаете ' \
     'проницательностью и можете хорошо отличать одно от другого.'
H2 = 'Вы склонны быть критичными, но вы также можете довольно правильно оценивать людей и события. Однако иногда Вам ' \
     'трудно увидеть все положительные стороны, так как Вам свойственно уделять больше внимания плохому в людях и в ' \
     'делах. Вы не такой понимающий человек, каким могли бы быть или каким следовало бы быть.'
H3 = 'Вы критичный человек. Другим людям тружно общаться с Вами из-за Вашего выраженного или скрытого ' \
     'неодобрительного отношения к людям и делам. Из-за Вашего постоянного внимания к плохим сторонам вещей Вы ' \
     'замечаете мало хорошего, в результате чего у Вас плохая способность правильно оценивать людей и обстоятельства.'
H4 = 'Вы чрезвычайно критичный человек. На словах или в мыслях Вы резко критикуете окружающих Вас людей и ' \
     'обстоятельства, в результате чего с Вами почти невозможно иметь дело. Вам самому может казаться, что Ваша ' \
     'критика конструктивна или реалистична, тогда как на самом деле Вы просто злобны и придирчивы. Поскольку Вы' \
     'видите мало хорошего в людях или в жизни, Ваше мнение не имеет большой ценности.'
I1 = 'Вам свойственна высокая степень симпатии. Вы можете вникнуть в ситуацию другого человека и тем самым лучше ' \
     'понять его точку зрения и чувства или то, что произошло или происходит. Вы способны изменять свои действия, ' \
     'так чтобы они были уместными в тех обстоятельствах, в которых Вы оказались.'
I2 = 'Вы умеете чувствовать другого человека, но не в такой степени, как Вам следовало бы. Хотя Вы способны в ' \
     'определенной степени поставить себя на место другого человека, Вы не всегда это делаете, что снижает Вашу ' \
     'способность понимать других. Кроме того, Ваш недостаток понимания других людей иногда приводит к тому, ' \
     'что Ваши действия или слова иногда оказываются неуместными или некорректными.'
I3 = 'Вы не можете чувствовать других людей. Вы не можете поставить себя на место другого человека и тем самым ' \
     'понять его точку зрения или его ситуацию. В результате этого Вы производите впечатление недоброжелательного ' \
     'и злобного человека, что создает для Вас очень много пролем в отношениях с другими людьми. Этот недостаток ' \
     'понимания делает Вас неотзывчивым и трудным в общении для окружающих.'
I4 = 'Вы совершенно холодных и бессердечный человек. Ваша полная неспособность вникнуть в ситуацию или положение ' \
     'другого человека и тем самым лучше понять его самого, создает для Вас очень много трудностей во ' \
     'взаимоотношениях с людьми в жизни. Вы придаете слишком большое значение себе и своей точке зрения, и поэтому ' \
     'неспособны считаться с мнением других.'
J1 = 'Вы очень общительный человек и Вам нравится разговаривать с людьми. В компании Вы легко общаетесь и легко ' \
     'ведете беседу с больнством присутствующих. Вы можете чувствовать или не чувствовать полную раскованность, ' \
     'общаясь с людьми, но это никак не сказывается на Вашей способности доносить до них свои идеи или мнения.'
J2 = 'Вы умеете свободно общаться с людьми. но не в той стопени, которая является достаточной для того, чтобы иметь ' \
     'по-настоящему большой успех в обществе или в бизнесе. Вам, может быть, свойственно замыкаться в себе. Это ' \
     'может быть вызвано застенчивостью или неприязнью к отдельным людям. Без сомнения, Вам следует поднять ' \
     'способность открыто общаться с другими людьми, чтобы улучшить свое положение в обществе и в бизнесе.'
J3 = 'Вы замкнуты. Вы не общаетесь свободно с другими людьми, возможно, из-за своей застенчивости или неприязни ' \
     'к людям. Такой замкнутый человек, как Вы, также опасается, что другие могут узнать о Вас что-то такое, что ' \
     'дискредитирует Вас в их глазах. Ваша неспособность свободно и открыто общаться с другими людьми мешает Вам ' \
     'заовдить друзей и достигать успеха в работе.'
J4 = 'Вы очень замкнутый человек. Это может быть результатом того, что Вы либо застенчивы, либо не любите людей, ' \
     'либо и то и другое. В дополнение к этому то, что Вы не общаетесь с людьми, говорит о Вашем стремлении скрыть ' \
     'от других что-то, что Вы не хотите, чтобы они узнали. Ваша неспособность свободно общаться очень сильно ' \
     'мешает Вам в жизни.'
